# Pandas-kommandoer ved bruk av 'penguins'-datasettet

I denne veiledningen skal vi bruke 'penguins'-datasettet fra seaborn-biblioteket for å demonstrere ulike pandas-kommandoer for sortering, gruppering, finne minimum og maksimum, telle antall og andre ofte brukte kommandoer. Vi vil også gi en oversikt over de mest brukte plottfunksjonene i seaborn.

# Importere nødvendige biblioteker og laste inn datasettet

In [1]:
# Importere nødvendige biblioteker og laste inn datasettet
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt

# Konfigurere visning av grafer i notebook
%matplotlib inline

# Laste inn 'penguins'-datasettet
df = sns.load_dataset('penguins')

# Vise de første fem radene
df.head()

,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex
0,Adelie,Torgersen,39.1,18.7,181.0,3750.0,Male
1,Adelie,Torgersen,39.5,17.4,186.0,3800.0,Female
2,Adelie,Torgersen,40.3,18.0,195.0,3250.0,Female
3,Adelie,Torgersen,NaN,NaN,NaN,NaN,NaN
4,Adelie,Torgersen,36.7,19.3,193.0,3450.0,Female